app/controllers/favorites_controller.rb

  def create
    @micropost = Micropost.find(params[:micropost_id])
    @favorite = current_user.favorite.build(micropost: @micropost)

    if @favorite.save
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ? LIMIT 1  [["id", 6]]
INSERT INTO "favorites" ("micropost_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["micropost_id", 6], ["user_id", 4], ["created_at", "2017-02-02 12:58:37.106441"], ["updated_at", "2017-02-02 12:58:37.106441"]]

  def destroy
  #   @favorite = current_user.favorite_relationships.find(params[:id]).favorited_usr
    #   current_user.unfavorite(@favorite)
    @favorite = current_user.favorite.find_by!(micropost_id: params[:micropost_id])
    @favorite.destroy
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."micropost_id" = ? LIMIT 1  [["user_id", 4], ["micropost_id", 6]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]