app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ?  ORDER BY "microposts"."created_at" DESC  [["user_id", 1]]
---
  def show # 追加
    @user = User.find(params[:id])
    @user_following = @user.following_relationships
    @user_follower = @user.follower_relationships
    @microposts = @user.microposts.order(created_at: :desc)

INSERT INTO "users" ("name", "email", "hometown", "age", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$UlM78zYN5daCAGjSY8GAAe7R1zUiPkmk4wWHJPECHz0aTAtftVRNa"], ["updated_at", "2017-01-24 13:03:43.198090"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def following
    @user = User.find(params[:id]) #現在のuser_id

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
  def follower
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ?  [["user_id", 3]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" IN (8, 4, 2)
---
  def favorites
    @user = User.find(params[:id])
    @feed_items = Micropost.where(id: @user.favorites.map{ |f| f.micropost_id })